UAV_Propeller/folder/Multicase_Optimization/Hover/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0.015;

boundaryField
{
    "(blade|spinner)"
    {
        type            kqRWallFunction;
        value           uniform 0.015;
    }
    "(inlet|outlet|outer|inout)"
    {
        type            inletOutlet;
        inletValue      uniform 0.015;
        value           uniform 0.015;
    }
    "cyc.*"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
